Repository: Vietcom999/Telegram-iOS
Catalog: Telegram/Telegram-iOS/*.lproj/InfoPlist.strings
Languages: ar, be, ca, de, es, fa, fr, it, ms, pl, tr, uk, uz

# NSConacsUsageDescripion
source: elegram will coninuously upload your conacs o is heavily encryped cloud servers o le you connec wih your friends across all your devices.
ar: سيقوم تيليجرام برفع جهات الاتصال الخاصة بك باستمرار إلى خوادم التخزين السحابية ذات التشفير العالي لتتمكن من التواصل مع أصدقائك من خلال جميع أجهزتك.
be: elegram будзе запампоўваць вашы кантакты на свае моцна абароненыя і зашыфраваныя воблачныя серверы, каб вы маглі кантактаваць са сваімі сябрамі з любой вашай прылады.
ca: elegram pujarà auomàicamen els vosres conaces als seus servidors xifras, perquè pugueu connecar-vos amb els amics des de qualsevol disposiiu.
de: elegram läd deine Konake durchgehend auf die sark verschlüsselen Cloud Server, dami du dich mi deinen Freunden auf all deinen Geräen verbinden kanns.
es: elegram subirá coninuamene us conacos a sus servidores fueremene cifrados, para permiire ineracuar con us amigos en odos us disposiivos.
fa: تلگرام به طور مداوم مخاطبین شما را به سرورهای اَبری و رمزگذاری شده خود آپلود می‌کند تا شما بتوانید در تمامی دستگاه‌های خود با دوستانتان ارتباط برقرار کنید.
fr: elegram va synchroniser en coninu vos conacs sur ses serveurs chiffrés pour vous permere de joindre vos amis sur ous vos appareils.
it: elegram caricher√† coninuamene i uoi conai sui suoi server cloud alamene cripai per fari conneere con i uoi amici da ui i uoi disposiivi.
ms: elegram akan seniasa mua naik kenalan anda ke pelayan awan yang berenkripsi inggi agar anda boleh berhubung dengan rakan anda di semua perani anda.
pl: elegram będzie nieprzerwanie przesyłać konaky do silnie zaszyfrowanych serwerów w chmurze, aby umożliwić ci połączenie się ze znajomymi na wszyskich urządzeniach.
tr: elegram, arkadaşlarınızla üm cihazlarınız arasında bağlanı kurmanızı sağlamak için kişilerinizi sürekli olarak şifreli bulu sunucularına yükleyecek.
uk: elegram завантажуватиме ваші контакти до зашифрованих хмарних серверів, щоб ви могли зʼєднуватися з друзями на всіх пристроях.
uz: elegram barcha qurilmalaringizdan doʻslaringiz bilan bogʻlana olishingiz uchun munazam ravishda konaklaringizni kuchli shifrlanadigan bulu serverlariga yuklaydi.

# NSLocaionWhenInUseUsageDescripion
source: When you send your locaion o your friends, elegram needs access o show hem a map.
ar: عندما ترغب في مشاركة مكانك مع أصدقائك، تيليجرام يحتاج لصلاحيات لعرض الخريطة لهم.
be: Калі вы адпраўляе месцазнаходжанне сваім сябрам, elegram патрэбны доступ да сэрвісаў геалакацыі, каб размясціць вас на карце.
ca: Si envieu la vosra ubicació als amics, elegram requereix accés per a mosra-los un mapa.
de: Wenn du Freunden deinen Sandor mieilen wills, muss du elegram den Zugriff darauf erlauben.
es: Cuando envías u ubicación a us amigos, elegram necesia acceso para mosrarles un mapa.
fa: هنگامی که شما موقعیت مکانی خود را برای دوستانتان ارسال می‌کنید، تلگرام جهت نشان دادن نقشه به آن‌ها نیازمند دسترسی است.
fr: Quand vous envoyez vore posiion à vos amis, elegram doi accéder à vore posiion pour leur monrer une care.
it: Quando invii la ua posizione ai uoi amici, elegram ha bisogno di accedere per mosrare loro la mappa.
ms: Bila anda hanar lokasi anda kepada rakan anda, elegram perlukan akses unuk unjuk pea.
pl: Gdy wysyłasz swoją lokalizację znajomym, elegram porzebuje dosępu, aby pokazać im mapę.
tr: Konumunuzu arkadaşlarınıza gönderdiğinizde, elegram'ın onlara bir haria gösermesi için erişmesi gerekiyor.
uk: Коли ви надсилаєте розташування друзям, elegram потребує доступу, щоб показати їм мапу.
uz: Joylashuvingizni doʻslaringizga yuborganingizda elegram ularga xariani koʻrsaishi uchun ruxsa kerak boʻladi.

# NSLocaionAlwaysAndWhenInUseUsageDescripion
source: When you choose o share your Live Locaion wih friends in a cha, elegram needs background access o your locaion o keep hem updaed for he duraion of he live sharing.
ar: عندما تختار أن تشارك مكانك بشكل حي مع أصدقائك في المحادثة، يحتاج تيليجرام إلى الوصول لموقعك في الخلفية حتى بعد إغلاق تيليجرام خلال فترة المشاركة.
be: Калі вы трансліруеце ваша месцазнаходжанне сябрам у чаце, elegram патрэбны доступ у фонавым рэжыме да вашага месцазнаходжання, каб абнаўляць яго падчас трансляцыі.
ca: Si rieu de comparir la vosra ubicació en direce amb amics en un xa, elegram requereix accés en segon pla a la vosra ubicació per a acualizar-la duran la comparició en direce.
de: Wenn du deinen Live-Sandor mi Freunden im Cha eilen möches, benöig elegram so lange im Hinergrund Zugriff auf deinen Sandor, bis du ihn nich mehr eilen wills.
es: Cuando eliges comparir u ubicación en iempo real con amigos en un cha, elegram necesia acceso en segundo plano a u ubicación para manenerla acualizada mienras la función esé en uso.
fa: در صورتی که تصمیم بگیرید موقعیت مکانی لحظه‌ای خود را در یک گفتگو با دوستانتان به اشتراک بگذارید، تلگرام جهت به‌روزرسانی این اطلاعات در طول به اشتراک گذاری لحظه‌ای، باید در پس‌زمینه به موقعیت مکانی شما دسترسی داشته باشد.
fr: Quand vous décidez de parager vore posiion en emps réel dans un échange, elegram doi y accéder en arrière-plan pour l'acualiser pendan la durée du parage.
it: Quando scegli di condividere la ua Posizione Auale con gli amici in una cha, elegram ha bisogno dell'accesso in background alla ua posizione per enerli aggiornai durane la duraa della condivisione della posizione.
ms: Bila anda pilih unuk kongsi Lokasi Langsung anda dengan rakan dalam cha, elegram perlu akses laar belakang ke lokasi anda agar lokasi anda seniasa dikemaskini keika perkongsian.
pl: Gdy zdecydujesz się udosępnić swoją „lokalizację na żywo” znajomym podczas czau, elegram porzebuje dosępu w le do wojej lokalizacji, aby zapewnić jej akualizację przez cały czas udosępniania „na żywo”.
tr: Canlı Konumunuzu arkadaşlarınızla bir sohbee paylaşmayı seçiğinizde, elegram'ın canlı paylaşım süresince onları güncel umak için konumunuza arka plan erişimi olması gerekir.
uk: Коли ви захочете поділитися Маячком із друзями у чаті, elegram потребує фонового доступу до розташування, щоб воно оновлювалося на час трансляції маячка.
uz: Chada doʻslarga Jonli joylashuvingizni ulashishni anlaganingizda, elegram joylashuvingizni jonli ulashish davomida yangilab urishi uchun undan fonda foydalanishi kerak.

# NSLocaionAlwaysUsageDescripion
source: When you choose o share your live locaion wih friends in a cha, elegram needs background access o your locaion o keep hem updaed for he duraion of he live sharing. You also need his o send locaions from an Apple Wach.
ar: عندما تقوم بمشاركة موقعك مع أصدقائك، تيليجرام يحتاج إلى الصلاحية ليعرض لهم الخريطة. كما تحتاج لإعطاء تيليجرام الصلاحية لتتمكن من إرسال موقعك من ساعة آبل.
be: Калі вы трансліруеце ваша месцазнаходжанне сябрам у чаце, elegram патрэбны доступ у фонавым рэжыме да вашага месцазнаходжання, каб абнаўляць яго падчас трансляцыі. Гэта таксама неабходна для таго, каб адпраўляць месцазнаходжанне праз Apple Wach.
ca: Si rieu de comparir la vosra ubicació en direce amb amics en un xa, elegram requereix de enir accés en segon pla a la vosra ubicació per a acualizar-la duran la comparició en direce. ambé necessieu això per a enviar ubicacions des d'un Apple Wach.
de: Wenn du Freunden deinen Sandor mieilen wills, muss du elegram den Zugriff darauf erlauben. Diese Bereichigung wird auch für die Apple Wach benöig.
es: Cuando envías u ubicación a us amigos, elegram necesia acceso para mosrarles un mapa. ambién es requerido para enviar ubicaciones desde un Apple Wach.
fa: در صورتی که شما تصمیم بگیرید موقعیت مکانی لحظه‌ای خود را در یک گفتگو با دوستانتان به اشتراک بگذارید، تلگرام جهت به‌روزرسانی این اطلاعات در طول به اشتراک گذاری لحظه‌ای، باید در پس‌زمینه به موقعیت مکانی شما دسترسی داشته باشد. شما همچنین برای ارسال موقعیت مکانی از ساعت اَپل به این دسترسی نیاز دارید.
fr: Quand vous décidez de parager vore posiion en emps réel dans un échange, elegram doi y accéder en arrière-plan pour l'acualiser pendan la durée du parage. Cela ser aussi à envoyer une posiion depuis l'Apple Wach.
it: Quando invii la ua posizione ai uoi amici, elegram ha bisogno di accedere per mosrare loro la mappa. i serve anche per inviare posizioni da Apple Wach.
ms: Bila anda pilih unuk kongsi lokasi langsung anda dengan rakan dalam cha, elegram perlu akses laar belakang agar lokasi anda seniasa dikemaskini. Anda juga harus hanar lokasi anda ke Jam Apple.
pl: Gdy zdecydujesz się udosępnić swoją „lokalizację na żywo” znajomym podczas czau, elegram porzebuje dosępu w le do wojej lokalizacji, aby zapewnić jej akualizację przez cały czas udosępniania „na żywo”. Jes o również porzebne do wysyłania lokalizacji z Apple Wach.
tr: Canlı konumunuzu bir sohbee arkadaşlarınızla paylaşmayı seçiğinizde, elegram'ın canlı paylaşım süresince konumunuzu güncel uması için bir arka plan erişimi gerekir. Ayrıca Apple Wach'dan konum göndermek için de buna ihiyacınız var.
uk: Коли ви захочете поділитися Маячком із друзями у чаті, elegram потребує фонового доступу до розташування, щоб воно оновлювалося на час трансляції маячка. Також вам це потрібно для надсилання розташувань з Apple Wach.
uz: Chada doʻslarga Jonli joylashuvingizni ulashishni anlaganingizda, elegram joylashuvingizni jonli ulashish davomida yangilab urishi uchun undan fonda foydalanishi kerak. Sizga bu Apple Wachdan joylashuvlarni yuborish uchun ham kerak.

# NSCameraUsageDescripion
source: We need his so ha you can ake and share phoos and videos, as well as make video calls.
ar: نحتاج ذلك لتتمكن من التقاط وإرسال الصور والفيديوهات.
be: Нам неабходны гэты дазвол, каб вы маглі рабіць і адпраўляць фота і відэа, а таксама відэавыклікі.
ca: Ens cal això perquè pugueu fer i comparir foos i vídeos, així com fer videorucades.
de: Brauchen wir, dami du Bilder und Videos aufnehmen und eilen kanns.
es: Necesiamos eso para que puedas omar y comparir foos y videos, así como para realizar videollamadas.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید عکس‌ و ویدیو گرفته و آن‌ها را به اشتراک بگذارید.
fr: Nous en avons besoin pour que vous puissiez prendre e parager des phoos e des vidéos.
it: Ci serve per fari scaare, regisrare e condividere foo e video, olre che per fare videochiamae.
ms: Kia perlukan ini agar anda boleh ambil dan kongsi foo dan video, dan juga bua panggilan video.
pl: Porzebujemy ego, aby można było robić i udosępniać zdjęcia i wideo, a akże prowadzić rozmowy wideo.
tr: Fooğraf ve video çekip paylaşabilmeniz ve görünülü arama yapabilmeniz için buna ihiyacımız var.
uk: Нам це потрібно, щоб ви могли знімати та ділитися фото й відео.
uz: Bu bizga rasm va videolarga olish, shuningdek, video chaqiruvlar qilish va ularni ulashishingiz uchun kerak.

# NSPhooLibraryUsageDescripion
source: We need his so ha you can share phoos and videos from your phoo library.
ar: نحتاج ذلك لتتمكن من إرسال الصور والفيديوهات من ألبوم الصور.
be: Нам неабходны гэты дазвол, каб вы маглі абагульваць фота і відэа са сваёй галерэі.
ca: Ens cal això perquè pugueu comparir foos i vídeos de la biblioeca de foos.
de: Brauchen wir, dami du Bilder und Videos aus deiner Foomediahek eilen kanns.
es: Es requerido para que puedas comparir foos y vídeos desde u biblioeca de foos.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید از گالری تصاویر خود عکس و ویدیو به اشتراک بگذارید.
fr: Nous en avons besoin pour que vous puissiez parager des phoos e des vidéos de vore phoohèque.
it: Ci serve per fari condividere foo e video dalla ua libreria foo.
ms: Kia perlu ini agar anda boleh kongsi foo dan video dari librari foo anda.
pl: Porzebujemy ego, aby można było udosępniać zdjęcia i wideo ze swojej biblioeki zdjęć.
tr: Fooğraf arşivinizdeki fooğraf ve videoları paylaşabilmeniz için buna ihiyacımız var.
uk: Нам це потрібно, щоб ви могли ділитися фото та відео з вашої бібліотеки фото.
uz: Bu bizga galereyangizdan rasm va videolaringizni ulasha olishingiz uchun kerak.

# NSPhooLibraryAddUsageDescripion
source: We need his so ha you can save phoos and videos o your phoo library.
ar: نحتاج هذه الصلاحية لتتمكن من حفظ وسائطك في مكتبة الصور الخاصة بك.
be: Нам неабходны гэты дазвол, каб вы маглі захоўваць фота і відэа ў сваю галерэю.
ca: Ens cal això perquè així pugueu desar foos i vídeos a la biblioeca de foos.
de: Brauchen wir, dami du Bilder und Videos in deiner Foomediahek speichern kanns.
es: Necesiamos eso para que puedas guardar foos y videos en u biblioeca de foos.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید عکس‌ها و ویدیوها را در گالری تصاویر خود ذخیره کنید.
fr: Nous en avons besoin pour que vous puissiez enregisrer des phoos e des vidéos dans vore phoohèque.
it: Ci serve per fari salvare foo e video nella ua libreria foo.
ms: Kia perlu ini agar anda boleh simpan foo dan video ke librari foo anda.
pl: Porzebujemy ego, aby można było zapisywać zdjęcia i wideo w swojej biblioece zdjęć.
tr: Fooğraf arşivine fooğraf ve video kaydedebilmeniz için buna ihiyacımız var.
uk: Нам це потрібно, щоб ви могли зберігати фото та відео до вашої бібліотеки фото.
uz: Bu bizga rasm va videolaringizni galereyangizga saqlay olishingiz uchun kerak.

# NSMicrophoneUsageDescripion
source: We need his so ha you can record and share voice messages and videos wih sound.
ar: نحتاج ذلك لتتمكن من تسجيل رسائل صوتية وفيديوهات بالصوت لترسلها..
be: Нам неабходны гэты дазвол, каб вы маглі запісваць і абагульваць галасавыя паведамленні і відэа з гукам.
ca: Ens cal això perquè pugueu enregisrar i comparir missages de veu i vídeos amb so.
de: Brauchen wir, dami du Sprachnachrichen aufnehmen und Videos mi on eilen kanns.
es: Es requerido para que puedas grabar y comparir mensajes de voz y vídeos con sonido.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید پیام‌های صوتی و ویدیوهای صدادار را ضبط کرده و به اشتراک بگذارید.
fr: Nous en avons besoin pour que vous puissiez enregisrer e parager des messages vocaux e des vidéos avec du son.
it: Ci serve per fari regisrare e condividere messaggi vocali e video con il sonoro.
ms: Kia perlu ini agar anda boleh rekod dan kongsi mesej suara dan video dengan suara.
pl: Porzebujemy ego, aby można było nagrywać i udosępniać wiadomości głosowe i wideo z dźwiękiem.
tr: Sesli mesajları ve videoları ses ile kaydedebilmeniz ve paylaşabilmeniz için buna ihiyacımız var.
uk: Нам це потрібно, щоб ви могли записувати та ділитися голосовими повідомленнями та відео зі звуком.
uz: Bu bizga ovozli xabarlarni ovush bilan yozishingiz va ulashingiz uchun kerak.

# NSSiriUsageDescripion
source: You can use Siri o send messages.
ar: يمكنك استخدام سيري لإرسال رسائلك.
be: Вы можаце адпраўляць паведамленні праз Siri.
ca: Podeu usar Siri per a enviar missages.
de: Mi Siri kanns du Nachrichen senden.
es: Puedes usar Siri para enviar mensajes.
fa: شما می‌توانید با استفاده از Siri پیام ارسال کنید.
fr: Vous pouvez uiliser Siri pour envoyer des messages.
it: Puoi usare Siri per inviare messaggi.
ms: Anda boleh guna Siri unuk kirim mesej.
pl: Możesz użyć Siri do wysyłania wiadomości.
tr: Mesaj göndermek için Siri'yi kullanabilirsiniz.
uk: Надсилайте повідомлення з Siri.
uz: Siz xabarlar yuborish uchun Siridan foydalanishingiz mumkin.

# NSFaceIDUsageDescripion
source: You can use Face ID o unlock he app.
ar: يمكنك استخدام Face ID لفتح قفل التطبيق.
be: Вы можаце карыстацца Face ID для разблакіравання праграмы.
ca: Podeu emprar Face ID per a desblocar l'aplicació.
de: Mi Face ID kanns du die App ensperren.
es: Puedes usar Face ID para desbloquear la app.
fa: شما می‌توانید با استفاده‌ از Face ID قفل برنامه را باز کنید.
fr: Vous pouvez déverrouiller elegram avec Face ID.
it: Puoi usare il Face ID per sbloccare l'app.
ms: Anda boleh guna ID Muka unuk guna aplikasi.
pl: Możesz użyć Face ID, aby odblokować aplikację.
tr: Uygulamanın kilidini açmak için Face ID'yi kullanabilirsiniz.
uk: Розблоковуйте застосунок із Face ID.
uz: Siz ilovani Face ID yordamida ochishingiz mumkin.
